Repository: miurahr/translate-django-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: From the command line, use the ``cd`` command to navigate to the directory where you'll want your local copy of Django to live.
ja: コマンドラインで、 ``cd`` コマンドを使い、Django をローカルに複製するディレクトリに移動します。

source: Full docs for the development server can be found in the :djadmin:`runserver` reference.
ja: 開発サーバーの詳細な説明は :djadmin:`runserver` のリファレンスを参照して下さい。

source: Generally, a view retrieves data according to the parameters, loads a template and renders the template with the retrieved data.
ja: naGenerally, a view retrieves data according to the parameters, loads a template and renders the template with the retrieved data.

source: Generating a patch file for your changes.
ja: 変更のパッチファイルを生成

source: Generating a patch for your changes
ja: 変更のパッチを生成する

source: Generating patches and attaching them to Trac tickets is useful, however, since we are using git - adopting a more :doc:`git oriented workflow </internals/contributing/writing-code/working-with-git>` is recommended.
ja: パッチを生成して､Tracのチケットに貼り付けるのは便利ですが､ git を使っている場合は､ `git ワークフロー </internals/contributing/writing-code/working-with-git>`_ の利用がオススメです｡

source: Get the latest version of Python at https://www.python.org/download/ or with your operating system's package manager.
ja: Pythonの最新版は https://www.python.org/download/ から入手できますし、利用中のOSのパッケージ管理ソフトから入れることもできるでしょう。

source: Getting a copy of Django's development version
ja: Django 開発版の複製を取得

source: Getting started
ja: さぁ始めましょう。

source: GitHub has a `nice tutorial`__.
ja: GitHub には `素敵なチュートリアル`__ があります。

source: Go ahead and add the ``smart_urlquote`` import at the end of line 13 of ``django/contrib/admin/widgets.py`` so it looks as follows::
ja: ``smartr_urlquote`` のインポートを ``django/contrib/admin/widgets.py`` の 13 行目の後ろに追加してください｡

source: Here's a quick example:
ja: これは簡単な例です：

source: Here's an example view for ``year_archive`` from above:
ja: ここで上記の``year_archive``のビューを見てみましょう:

source: Here's an informal overview of how to write a database-driven Web app with Django.
ja: ここでは Django による データベース中心の Web アプリケーション開発をざっと見てみましょう。

source: Here's what a URLconf might look like for the ``Reporter``/``Article`` example above:
ja: ここで、URLconfが上記の ``Reporter``/``Article``の例でどのようになるか見てみましょう：

source: Here's what happens if a user goes to "/polls/34/" in this system:
ja: このシステムでユーザが "/polls/34/" にアクセスすると、次のように処 理されます:

source: Here's what it looks like at this point:
ja: ここでは以下のようになります:

source: Here's what that might look like:
ja: テンプレートは以下のように書かれています:

source: Here's what the "base.html" template, including the use of :doc:`static files </howto/static-files/index>`, might look like:
ja: ここでよくある“base.html” テンプレートで、 :doc:`静的ファイルの配信 </howto/static-files/index>` を含む例をあげます:

source: How to download a development copy of Django.
ja: 開発版の Django の複製をダウンロード

source: However, in bigger projects -- especially those comprised of multiple apps -- dealing with the multiple sets of static files provided by each application starts to get tricky.
ja: Web サーバが見つけられる場所で静的ファイルを単に管理することができるからです。しかし、もっと大きな プロジェクトで、特に複数のアプリケーションからなる場合は、各アプリケーションが 持っている静的ファイルの集まりを複数扱うことになり、ややこしくなってきます。

source: However, you'll probably want to read some more about these different tools if you plan on contributing to Django regularly.
ja: しかし、Django に定期的に貢献したい場合は、このツールの詳細について知りたいかもしれません。

source: If a template doesn't exist in the first directory, it checks the second, and so on.
ja: 最初のディレクトリにテンプレートが見つからなければ、２番目、３番目と見ていきます。

source: If all of the tests passed, then you'll want to make sure that you added the new test shown above to the appropriate folder and class.
ja: テストがすべて通れば､上記した新しいテストを正しいフォルダ､クラスに追加したことを確認してください｡

source: If all the tests still pass, then you can be reasonably sure that your changes haven't completely broken Django.
ja: すべてのテストに合格した場合は、その変更により Django が壊れていないことが確認できます。

source: If at this point, instead of the above login page, you get an error page reporting something like::
ja: もしこの時点で、上のログイン画面の代わりに以下のようなエラーの画面が表示された場合は:

source: If it doesn't, make sure you correctly modified the ``AdminURLFieldWidget`` class as shown above and copied the new tests correctly.
ja: もしそうでない場合､ ``AdminURLFieldWidgt`` クラスと新しいテストが正しくコピーされているされていると確認してください｡

source: If that's not quite your style, there are many other `books about Python`_.
ja: その方法が肌に合わない場合は、他にも `books about Python`_があります。

source: If the patch's content looked okay, you can run the following command to save the patch file to your current working directory::
ja: パッチの内容が良さそうなら､以下のコマンドを実行して､現在のワーキングディレクトリにパッチを保存してください｡

source: If the regex uses simple captures, values are passed as positional arguments; if it uses named captures, values are passed as keyword arguments.
ja: 正規表現が単純にキャプチャをしている場合は位置引数として、名前付きでキャプチャしている場合はキーワード引数として呼び出します。

source: If the tests ran correctly, you should see three failures corresponding to each of the test methods we added.
ja: テストが正しく実行されれば､追加したテストメソッドに対応する3つのテストが失敗するでしょう｡

source: If this is your first time using Django, you'll have to take care of some initial setup.
ja: 初めて Django を使うのなら、最初のセットアップを行う必要があります。

source: If you already know a few other languages and want to get up to speed with Python quickly, we recommend `Dive Into Python`_.
ja: すでに他の言語を既に知っていて、Pythonを素早く理解したい場合は、 `Dive Into Python`_を推薦します。

source: If you are upgrading your installation of Django from a previous version, you will need to :ref:`uninstall the old Django version before installing the new version <removing-old-versions-of-django>`.
ja: 前バージョンの Django をアップグレードするには、 :ref:`新しい Django をインストールする前に、古いバージョンの Django をアンインストールする <removing-old-versions-of-django>` 必要があります。

source: If you click to view a particular build, you can view the "Configuration Matrix" which shows failures broken down by Python version and database backend.
ja: 各ビルドについてのリンクをクリックすれば､ "Configuration Matrix" という､ 各 Python のバージョン､ DB バックエンドに対応したテストの失敗を閲覧できます｡

source: If you do either of the first two steps, keep an eye out for parts of the documentation marked **new in development version**.
ja: 初め 2 ステップのどちらかをした場合は、ドキュメントの **new in development version** とマークされた部分に気をつけてください。

source: If you get failures or errors make sure you've followed all of the previous steps properly.
ja: もし失敗するかエラーが起こる場合は､これまでの全ステップを適切に実行してください｡

source: If you get messages saying that this command could not be found, you'll have to download and install it, see `Git's download page`__.
ja: もし、コマンドがない、というメッセージが出た場合は、ダウンロードしてインストールの必要があるでしょう。 `Git's download page`__を見てください。

source: If you have difficulty finding where the Django source files are located on your system, run the following command:
ja: Django のソースファイルがシステム中のどこにあるのか分からない場合は、以下のコマンドを実行してください:

source: If you haven't recently completed Tutorials 1â6, we encourage you to review these so that your example project matches the one described below.
ja: ç´è¿ã®ãã¥ã¼ããªã¢ã« 1 - 6 ãçµãã£ã¦ããªããªããä¸ç®éããã¨ããããããã¾ããä¾ã§ä½ã£ããã­ã¸ã§ã¯ããä»¥ä¸ã®èª¬æã§ãä½¿ãããããã§ãã

source: If you haven't recently completed Tutorials 1–6, we encourage you to review these so that your example project matches the one described below.
ja: 直近のチュートリアル 1 - 6 が終わっていないなら、一目通すことをおすすめします。例で作ったプロジェクトが以下の説明でも使われるからです。

source: If you just want to get started already (and nobody would blame you!), try taking a look at the list of `easy tickets that need patches`__ and the `easy tickets that have patches which need improvement`__.
ja: 今すぐ始めたいなら (責める人はいません！)、 `パッチが必要な簡単なチケット`__ か `パッチに改善が必要な簡単なチケット`__ を見つけましょう。

source: If you need help with regular expressions, see `Wikipedia's entry`_ and the documentation of the :mod:`re` module.
ja: 正規表現についてわからないことがあれば `Wikipediaのエントリー`_ と :mod:`re` モジュールのドキュメントを参照してください。

source: If you use Jython_ (a Python implementation for the Java platform), you'll need to follow a few additional steps.
ja: もし Jython_ (Python のJava プラットフォーム実装) を使っている場合は、いくつか追加のステップを実行する必要があります。

source: If you want to change the server's port, pass it as a command-line argument.
ja: サーバーのポートを変えたい場合は、以下のようにコマンドライン引数を渡してください。

source: If you want to remove the added slot, you can click on the X to the top right of the added slot.
ja: 追加されたスロットを削除したい場合は、追加されたスロット右上の 'X' をクリックしてください。

source: If you're familiar with writing tests, you can also look at the list of `easy tickets that need tests`__.
ja: テストを書きなれているなら `テストが必要な簡単なチケット`__ でもよいでしょう。

source: If you're having trouble going through this tutorial, please post a message to |django-developers| or drop by `#django-dev on irc.freenode.net`__ to chat with other Django users who might be able to help.
ja: もしこのチュートリアルを通じて理解できないことについては、 |django-developers| にメッセージを送るか `#django-dev on irc.freenode.net`__ で他の Django ユーザーとのチャットが助けになるかもしれません。

source: If you're new to Python_, you might want to start by getting an idea of what the language is like.
ja: Python_ の初心者なら、まず Python がどんなものかを知ることから始めましょう。

source: If you're new to programming entirely, you might want to start with this `list of Python resources for non-programmers`_
ja: プログラミング全般の初心者なら、 `非プログラマのための Python リソース一覧`_ から始めてみるとよいでしょう。

source: If you're not that familiar with Git, you can always find out more about its commands (once it's installed) by typing ``git help`` into the command line.
ja: もし Git について詳しく知らない場合は、(インストール後に) コマンドラインから ``git help`` と入力するとコマンドの使い方を確認できます。

source: If you're on Windows, the above should work provided that you are using "Git Bash" provided by the default Git install.
ja: Windows の場合は、Git のデフォルトインストールで提供される "Git Bash" を使用することにより上記コマンドが実行できます。

source: If you're using SQLite, you don't need to create anything beforehand - the database file will be created automatically when it is needed.
ja: SQLite を使っている場合は、前もってすることはありません。必要であればデータベースファイルが自動で生成されます。

source: If you're using ``virtualenv``, you can omit ``PYTHONPATH=..`` when running the tests.
ja: もし ``virtualenv`` を利用している場合は、テストの実行に ``PYTHONPATH=..`` のステップは不要です。

source: If you've got questions, it's probably got the answers.
ja: あなたの疑問への答えが見つかるはずです。

source: If you've never had to deal with tests before, they can look a little hard to write at first glance.
ja: テストを書いたとこがない場合は､最初は難しく見えるかもしれません｡

source: If you've never run Django's test suite before, it's a good idea to run it once beforehand just to get familiar with what its output is supposed to look like.
ja: Django のテストスイートを実行したことが一度もない場合、その出力結果を把握しておくために、一度テストスイートを実行しておくことを推奨します。

source: If your background is in plain old PHP (with no use of modern frameworks), you're probably used to putting code under the Web server's document root (in a place such as ``/var/www``).
ja: (モダンなフレームワークを使わない) 古いプレーンな PHP の経験があるなら、これまでは Web サーバのドキュメントルート下 (``/var/www`` といった場所) にコードを配置してきたことでしょう。

source: If your new tests don't fail, you'll need to fix them so that they do.
ja: 新しいテストが落ちない場合は落ちるよう修正しましょう｡

source: In Django, we refer to these files as "static files".
ja: Djangoでは、これらのファイルを "静的ファイル" と呼びます。

source: In a more sophisticated application, you might have dozens of complex interactions between components.
ja: 高機能なアプリケーションでは、コンポーネント間で複雑な連携が数多くあるかもしれません。

source: In a nutshell, this means that code you develop against a 1.X version of Django will continue to work with future 1.X releases.
ja: 簡単にいうと、これは、Django １．Xバージョンに対して開発したコードは、 将来の1.Xバージョンに対して、継続的に動作するということを意味しています。

source: In a request to ``http://www.example.com/myapp/?page=3``, the URLconf will also look for ``myapp/``.
ja: ``http://www.example.com/myapp/?page=3`` の場も同じく、 URLconf は ``myapp/`` を見ます。

source: In addition, you should have a good understanding of Python itself.
ja: また、Python 自体をよく理解している必要があります。

source: In fact, complex regexes can have poor lookup performance, so you probably shouldn't rely on the full power of regexes.
ja: それに複雑な正規表現はルックアップのパフォーマンスが悪いので、正規表現のフルパワーに依存するのはよくありません。

source: In general, everything covered in the documentation -- with the exception of anything in the :doc:`internals area </internals/index>` is considered stable.
ja: 一般的に言って、:doc:`internals area </internals/index>` を除いて、ドキュメントに記載されているものは全て、安定であると考えられます。

source: In most cases, for a patch to be accepted into Django it has to include tests.
ja: 大抵の場合､ Django にアクセプトされるパッチはテストを含んでいます｡

source: In order to resolve this ticket, we'll add a ``render`` method to the ``AdminURLFieldWidget`` in order to display a clickable link above the input widget.
ja: このチケットを解決するには､ ``render`` メソッドを ``AdminURLFieldWidget`` に追加します｡ input ウィジェットの上にクリック可能なリンクをするようにします｡

source: In our poll application, we'll have the following four views:
ja: 投票アプリケーションでは、以下4つのビューを作成します:

source: In practice, however, you don't need to be an expert on regular expressions, as you really only need to know how to capture simple patterns.
ja: しかし実際問題としては、正規表現のエキスパートになる必要はありません。単純なパターンをキャプチャする方法を知っていれば十分です。

source: In short, all POST forms that are targeted at internal URLs should use the :ttag:`{% csrf_token %}<csrf_token>` template tag.
ja: 手短に言うと、全ての自サイトへの POST フォームに、 :ttag:`{% csrf_token %}<csrf_token>` テンプレートタグを使います。

source: In the ``polls/urls.py`` file include the following code:
ja: ``polls/urls.py`` ファイルには以下のコードを書いてください:

source: In this case, the date filter formats a Python datetime object in the given format (as found in PHP's date function).
ja: この例では、フィルタによって Python の datetime オブジェクトを指定の形式にフォーマットしています (PHP の date 関数に似ていますね) 。

source: In your Django settings, you specify a list of directories to check for templates with :setting:`DIRS <TEMPLATES-DIRS>`.
ja: Django設定の :setting:`DIRS <TEMPLATES-DIRS>`で、ディレクトリーのリストを定義することで、テンプレートを探す場所を指定できます。

source: Install Django
ja: Django をインストールする

source: Install Python
ja: Python をインストールする

source: Install a version of Django :doc:`provided by your operating system distribution </misc/distributions>`.
ja: :doc:`OSディストリビューションに提供される </misc/distributions>` Django のバージョンをインストールします。

source: Install it
ja: モデルのインストール

source: Installing Git
ja: Git のインストール

source: Installing Git.
ja: Git のインストール

source: Installing Python packages with virtualenv
ja: virtualenv に Python パッケージをインストールする

source: Installing some prerequisites
ja: 事前に必要な物をインストールする

source: Instead of using that, you can hard-code links to object-specific admin pages in whatever way you think is best.
ja: ベストだと思うなら、これを使う代わりに、オブジェクト固有の管理ページヘのリンクをハードコードをしてもよいです。

source: Interested in giving back to the community a little?
ja: 少しでもコミュニティへ恩返しをしたいと思われますか?

source: Introducing automated testing
ja: 自動テストの導入

source: Introduction
ja: はじめに

source: It can generate a PDF file, output XML, create a ZIP file on the fly, anything you want, using whatever Python libraries you want.
ja: PDF ファイルを生成しても、 XML を出力しても、 ZIP ファイルをその場で生成してもかまいません。Python ライブラリを使ってやりたいことを何でも実現できます。

source: It can use a template system such as Django's -- or a third-party Python template system -- or not.
ja: Django のテンプレートシステム、あるいはサードパーティの Python テンプ レートシステムを使ってもよいですし、使わなくてもかまいません。

source: It contains a ton of useful information and should be your first source for answering any questions you might have.
ja: そこにはたくさん有用な情報がありまし､質問があれば､このドキュメントが1番役に立ちます｡

source: It contains lots of great information and is a must read for anyone who'd like to become a regular contributor to Django.
ja: このドキュメントには、多くの重要な情報が含まれており、Django に定期的に貢献したい方は是非一読してください。

source: It covers Trac etiquette, how to claim tickets for yourself, expected coding style for patches, and many other important details.
ja: Trac でのエチケットやチケットをクレームする方法やパッチに適切なコーディングスタイルなど､重要なことを網羅できます｡

source: It has lots of good advice for those of us who are new to helping out with Django.
ja: Django に初めて協力する人たちへの良いアドバイスがあります｡

source: It worked!
ja: やりましたね！

source: It works like this: There are three slots for related Choices -- as specified by ``extra`` -- and each time you come back to the "Change" page for an already-created object, you get another three extra slots.
ja: 変わった点をみてみましょう。リレーション相手である ``Choice`` を表示するために 3 つのスロットがあります (``extra`` に指定した数ですね)。また、作成済みのオブジェクトを「編集する」ページに行けば、いつでも 3 つ余分のスロットが表示されるはずです。

source: It'll consist of two parts:
ja: Poll アプリケーションは 2 つの部分からなります:

source: It'll run the ``detail()`` method and display whatever ID you provide in the URL.
ja: ``detail()`` メソッドが実行され、URLで提供したIDが表示されます。

source: It's as easy as registering your model in the admin site:
ja: 管理サイトで、モデルの登録を行うのと同じくらいの簡単さです。

source: It's not a good idea to put any of this Python code within your Web server's document root, because it risks the possibility that people may be able to view your code over the Web.
ja: Python コードを Web サーバーのドキュメントルート下に置かないでください｡コードをドキュメントルート下に置くと、 誰かがコードを Web を介して読めるようになってしまうからです。

source: It's not displayed on the admin index page.
ja: admin のインデクスページを見ても表示されていませんね。

source: It's silly.
ja: ばかげています。

source: It's useful for URLField to give you a way to open the URL; otherwise you might as well use a CharField.
ja: URLField は URL を開けるようにするのに便利です; CharField を使ってもかまいません｡

source: Just remember to follow the guidelines about claiming tickets that were mentioned in the link to Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`.
ja: ただ、チケットのクレームに関するガイドラインに従ってください。 Django ドキュメントの :doc:`チケットをクレームしてパッチを送る </internals/contributing/writing-code/submitting-patches>` で記述されています。

source: Let's create a real version.
ja: 今度は、本物を実装しましょう。

source: Let's learn by example.
ja: さあ、例を交えながら学んでゆきましょう。

source: Let's look at what :djadmin:`startproject` created::
ja: :djadmin:`startproject` が何を作成したかをみてみましょう::

source: Let's run all the tests in the ``model_forms_regress`` folder to make sure that's really what happens.
ja: ``model__forms_regress`` フォルダの全テストを走らせて､実際に何が起こるか観てみましょう｡

source: Let's say the ``news/year_archive.html`` template was found.
ja: さて、 ``news/year_archive.html`` が見つかったとしましょう。

source: Let's update our poll detail template ("polls/detail.html") from the last tutorial, so that the template contains an HTML ``<form>`` element:
ja: それでは、前回のチュートリアルで作成した投票詳細テンプレート ("polls/detail.html") を更新して、HTML の ``<form>`` 要素を入れましょう。

source: Make the poll app modifiable in the admin
ja: Poll アプリを admin 上で編集できるようにする

source: Maybe you've found a bug in Django that you'd like to see fixed, or maybe there's a small feature you want added.
ja: それは Django の簡単なバグフィックスや小さな機能追加かもしれません。

source: Meanwhile, ``x`` and ``s`` indicated expected failures and skipped tests, respectively.
ja: ``x`` と ``s`` はそれぞれ期待する失敗とスキップを表しています。

source: Models
ja: モデル

source: Modifying the user libraries can affect other Python software on your system.
ja: ユーザーライブラリの変更はシステム上の他の Python ソフトウェアに影響を与えるおそれがあります

source: Month-based archive page -- displays all days with entries in the given month.
ja: 月ごとのアーカイブページ - 指定された月のエントリーの日をすべて表示

source: More information for new contributors
ja: 新しい貢献者のための情報

source: More sexy automatically-generated admin features -- this overview barely scratched the surface.
ja: 自動生成される admin のセクシーな機能の数々。ここで紹介したのはほんの表層の一部でしかありません。

source: Move the ``polls`` directory into the ``django-polls`` directory.
ja: ``polls`` ディレクトリを ``django-polls`` ディレクトリに移動する

source: Namely, you'll need to auto-generate some code that establishes a Django :term:`project` -- a collection of settings for an instance of Django, including database configuration, Django-specific options and application-specific settings.
ja: 通常は、 Django の :term:`プロジェクト` (:term:`project`) を構成するコードを自動生成します。プロジェクトとは、データベースの設定や Django 固有のオプション、アプリケーション固有の設定などといった、個々の Django インスタンスの設定を集めたものです。

source: Naming your URL lets you refer to it unambiguously from elsewhere in Django especially templates.
ja: RL に名前付けをしておけば Django のどこからでも明確に参照できます。

source: Navigate into Django's root directory (that's the one that contains ``django``, ``docs``, ``tests``, ``AUTHORS``, etc.).
ja: Django のルートディレクトリ (このディレクトリには ``django``, ``docs``, ``tests``, ``AUTHORS``, 等が含まれています) へ移動します。

source: Navigate to Django's ``tests/regressiontests/admin_widgets/`` folder and open the ``tests.py`` file.
ja: Djangoの ``tests/regressiontests/admin_widgets/``フォルダーに移動して、 ``tests.py`` ファイルを開きます。

source: Navigate to the ``django/django/contrib/admin/`` folder and open the ``widgets.py`` file.
ja: ``django/django/contrib/admin`` フォルダーに行って､ ``widgets.py`` ファイルを開いてください｡

source: New to Django?
ja: Django は初めてですか?

source: Next we'll be adding the functionality described in ticket :ticket:`17549` to Django.
ja: 次は :ticket:`17549` で説明されている機能を Django に追加します｡

source: Next, add the following at the top of ``polls/templates/polls/index.html``:
ja: 次に、``polls/templates/polls/index.html`` の上部に追加します:

source: Next, run the Django command-line utility to create the database tables automatically:
ja: 次に、データベーステーブルを自動でつくる Django のコマンドラインユーティリティを実行します:

source: Note ``{{ article.pub_date|date:"F j, Y" }}`` uses a Unix-style "pipe" (the "|" character).
ja: ``{{ article.pub_date|date:"F j, Y" }}`` で、 Unix スタイルの「パイプ」 (文字 “|”) を使っていることに注意して下さい。

source: Note that per-user installations can still affect the behavior of system tools that run as that user, so ``virtualenv`` is a more robust solution (see below).
ja: ユーザー単位でのインストールは依然、そのユーザーのシステムツールの振る舞いに影響をあたえます。なので ``virtualenv`` はより確実な解決になります (下記を参照してください) 。

source: Note that the latest Django trunk may not always be stable.
ja: 開発中の､最新の Django ではステーブルとは限りません｡

source: Note that there is an extra "Delete?" column that allows removing rows added using the "Add Another Choice" button and rows that have already been saved.
ja: 追加の "Delete?" カラムがあることに注意してください。 "Added Another Choice" ボタンで追加された行とすでに保存された行を削除するためにあります。

source: Note that these regular expressions do not search GET and POST parameters, or the domain name.
ja: これらの正規表現は GET, POST のパラメータや、ドメイン名からは検索しません。

source: Note that this fix also made a `small CSS change`__ to format the new widget.
ja: このチケットでは `少し CSS を変更`__ して新しいウィジェットをフォーマットします｡

source: Note that you can't remove the original three slots.
ja: 最初からある 3 つのスロットを削除できないことに注意してください。

source: Note the following:
ja: 以下に注意してください:

source: Now "Choices" is an available option in the Django admin.
ja: これで、 Django の管理サイト上で「Choice」 を選べます。

source: Now for our hands-on example.
ja: ハンズオンでの例題

source: Now it's time to generate a patch file that can be uploaded to Trac or applied to another copy of Django.
ja: Trac にアップロードされたり､他のDjangoに適応されるパッチを作りましょう｡

source: Now let's add a few more views to ``polls/views.py``.
ja: それではもう少しviewを``polls/vies.py``に追加していきましょう。

source: Now sit back and relax.
ja: それでは一息つきましょう。

source: Now that the server's running, visit http://127.0.0.1:8000/ with your Web browser.
ja: さあ、これでサーバが起動したので、ブラウザで http://127.0.0.1:8000/ にアクセスしてみてください。

source: Now that you've got that under your belt, you can put those skills to good use by helping to improve Django's codebase.
ja: パッチの書き方を習得したので､ Django のコードベースを改善するためにスキルを活かしましょう｡

source: Now that your environment -- a "project" -- is set up, you're set to start doing work.
ja: さあ、これで自分用の環境、すなわちプロジェクトが立ち上がり、作業にとりかかる準備ができました。

source: Now, let's create a Django view that handles the submitted data and does something with it.
ja: 送信されたデータを処理するための Django のビューを作成しましょう。

source: Now, open a Web browser and go to "/admin/" on your local domain -- e.g., http://127.0.0.1:8000/admin/.
ja: 次はブラウザを起動して、ローカルドメインの “/admin/” 、つまり http://127.0.0.1:8000/admin/ にアクセスします。

source: On a similar note, you might want to customize the look and feel of the Django admin index page.
ja: 近い話題として、 Django の admin index ページのルックアンドフィールをカスタマイズもできます。

source: Once one of the regexes matches, Django imports and calls the given view, which is a simple Python function.
ja: 一度正規表現が一致すると、 Django は Python の関数であるビュー (view) をインポートし呼び出します。

source: Once the tests complete, you should be greeted with a message informing you whether the test suite passed or failed.
ja: テストが終了するとテストが成功したか､失敗したかを知らせるメッセージが表示されます｡
